Repository: kkszysiu/bisho
Catalog: po/*.po
Languages: fi

source: My Web Accounts
fi: Omat Web-tilit

source: myzone & status
fi: myzone & tila

source: Launch site for more information.
fi: Etsi lisätietoja avaamalla sivusto.

source: <small>You'll need an account with %s and an Internet connection to use this web service.</small>
fi: <small>Käyttääksesi tätä verkkopalvelua tarvitset Internet-yhteyden ja käyttäjätilin, jossa on %s.</small>

source: Sorry, we can't log in to %s. %s
fi: Kohteeseen %s ei voi kirjautua sisään. %s

source: Sorry, we can't log in to %s
fi: Ei voida kirjautua kohteeseen %s

source: Log in succeeded. You'll see new things from %s in a couple of minutes.
fi: Kirjautuminen onnistui. Näet uutta sisältöä kohteesta %s muutaman minuutin kuluessa.

source: Sorry, we can't log into %s.
fi: Ei voida kirjautua kohteeseen %s.

source: Log out succeeded. All trace of %s has been removed from your computer.
fi: Uloskirjautuminen onnistui. Kaikki %s jäljet on poistettu tietokoneeltasi.

source: Update
fi: Päivitys

source: Log in
fi: Kirjaudu sisään

source: Quit
fi: Lopeta

source: Username:
fi: Käyttäjätunnus:

source: Password:
fi: Salasana:

source: Set up your social networks to see new updates in myzone and the status panel.
fi: Määritä sosiaaliset verkkosi nähdäksesi päivityksiä myzone:ssa ja tilapaneelissa.

source: Log me in
fi: Kirjaudu sisään

source: Connecting...
fi: Yhdistetään...

source: Continue
fi: Jatka

source: Log in succeeded. You'll see new items in a couple of minutes.
fi: Kirjautuminen onnistui. Näet uutta sisältöä muutaman minuutin kuluessa.

source: Log me out
fi: Kirjaudu ulos

source: You don't seem to have a network connection, this won't work.
fi: Verkkoyhteyttä ei näytä olevan saatavilla, joten tämä ei toimi.

source: You could check that the computer's clock is correct.
fi: Tarkista, että tietokoneen kello näyttää oikeaa aikaa.

source: You could try again.
fi: Voit yrittää uudelleen.

source: Once you have logged in to %s, press Continue.
fi: Paina Jatka, kun olet kirjautuneena palveluun %s.

source: Once you have logged in to %s, enter the code they give you and press Continue.
fi: Kun olet kirjautunut palveluun %s, anna koodi joka sinulle annetaan ja paina Jatka.

source: Code:
fi: Koodi:
